import pandas as pd

df = pd.read_excel("read_sample.xlsx", engine="openpyxl")
df = df[["상품주문번호", "수취인명", "옵션정보", "수량", "수취인연락처1", "수취인연락처2", "배송지", "배송메세지"]]

df["내품명"] = ""
df["운임구분"] = "신용"
df["박스타입"] = "극소"
df["기본운임"] = 2050
df["보내는분성명"] = "몬스터moster"
df["보내는분주소(전체, 분할)"] = "인천 서구 가좌동 585-14 cj대한통운 인천가좌심곡대리점"
df["보내는분전화번호"] = "1522-8145"
df["보내는분기타연락처"] = ""

df = df[
    [
        "상품주문번호",
        "수취인명",
        "배송지",
        "수취인연락처1",
        "수취인연락처2",
        "옵션정보",
        "내품명",
        "수량",
        "배송메세지",
        "운임구분",
        "박스타입",
        "기본운임",
        "보내는분성명",
        "보내는분주소(전체, 분할)",
        "보내는분전화번호",
        "보내는분기타연락처",
    ]
]
df = df.rename(
    columns={
        "상품주문번호": "고객주문번호",
        "수취인명": "받는분성명",
        "배송지": "받는분주소(전체,분할)",
        "수취인연락처1": "받는분전화번호",
        "수취인연락처2": "받는분기타연락처",
        "옵션정보": "품목명",
        "수량": "내품수량",
    }
)


# 받는분섬명 , 받는분주소, 받는분전화번호를 기준으로 중복데이터 찾아내기
df = df[df.duplicated(keep=False, subset=["받는분성명", "받는분주소(전체,분할)", "받는분전화번호"])]

df.to_excel("test_sample.xlsx", index=False)
